package com.github.gimazdo.profburobot.discord.commands.messages;

public class Messages {
    public final static String GREETING_MESSAGE = """
            Приветствую тебя на сервере института информационных технологий и программирования!\s
            Чтобы получить доступ к каналам на сервере тебе нужно пройти авторизацию. Это можно сделать 2мя способами: \n
            1. В чате Регистрация написать команду /register. Ввести логин и пароль от личного кабинета ГУАП. Бот сменит твое имя автоматически и выдаст тебе роли. 
            Бот не сохраняет ваши пароли и использует всего один раз, чтобы получить ваше имя. Если вы боитесь давать свой пароль, 
            то используйте 2й пункт или авторизуйтесь через бота и смените пароль ;) \n
            2. Поменять имя на сервере на твоё реальное (Пример: Иван Петров). Через некоторое время кто-то из админов выдаст тебе роль \n
            Если ты новенький в дискорде ниже инструкция как сменить имя.""";
}
